{"sections":{"main":{"type":"main-page","settings":{"padding_top":28,"padding_bottom":0}},"b8f5aa27-afc8-4fbb-a694-395bf38abefb":{"type":"custom-text-with-block","blocks":{"43e7e6ed-2184-460d-8777-e03741bb3b32":{"type":"blocks","settings":{"img_select":"shopify:\/\/shop_images\/img6.webp","img_url":"","heading":"<p><em><strong>Original Factory in Mamaroneck, NY Circa 1930<\/strong><\/em><\/p>"}},"506f31ba-080e-4fa5-8648-5cf502ddb057":{"type":"blocks","settings":{"img_select":"shopify:\/\/shop_images\/img7.webp","img_url":"https:\/\/cdn.shopify.com\/s\/files\/1\/2656\/7610\/files\/Allpax-certificate-large.jpg?v=1611848723","heading":"<p><em><strong>Certificate of Appreciation from Admiral Richard Byrd<\/strong><\/em><\/p>"}},"9f878cc9-19ca-40ae-8a03-282e250adfa3":{"type":"blocks","settings":{"img_select":"shopify:\/\/shop_images\/img8.webp","img_url":"","heading":"<p><em><strong>Headquarters: Allpax Gasket Cutter Products<br\/>1990 – 2000<\/strong><\/em><\/p>"}}},"block_order":["43e7e6ed-2184-460d-8777-e03741bb3b32","506f31ba-080e-4fa5-8648-5cf502ddb057","9f878cc9-19ca-40ae-8a03-282e250adfa3"],"settings":{"content":"<p>Founded in 1928, The Allpax Company, Inc. of Mamaroneck, NY was originally a manufacturer of rubber galoshes and raingear. With a reputation for ruggedness and durability, Allpax equipment was issued to Admiral Richard Byrd for his famous 1928 - 1930 Antarctic Expedition. Later, experience with these rubber products led Allpax to opportunities within the gasket material market. In 1990 Allpax Gasket Cutter Products, Inc. (AGCP) was formed to develop and manufacture a proprietary line of gasket cutters.<br\/><br\/>In 1999 Guardair Corporation acquired certain assets of AGCP and began manufacturing in Chicopee, Massachusetts. Here, organized as the Allpax Gasket Cutter System Division, extension-style gasket cutter kits, hollow punch tools, and a complete line of replacement parts are produced.<\/p>","img":"shopify:\/\/shop_images\/img5.webp","text":"<p>In 2012, certain assets of Allen Gasket Cutting Machine Company of New Bedford, MA were acquired, thereby adding rotary-style gasket cutters to the Allpax product line. Today, the Allpax Division has grown to become the largest manufacturer of gasket cutters and accessories in the world. Allpax products are sold through our national and international network of over 1,200 industrial MRO (Maintenance, Repair, and Operations) dealers and distributors.<\/p>"}}},"order":["main","b8f5aa27-afc8-4fbb-a694-395bf38abefb"]}